app/controllers/ledgers_controller.rb

  def index
    # localhost:3000/ledgers?playlist_id=1&song_id=1
    puts "ledgers params=#{params}"
    @ledgers = Ledger.all

    ledger = Ledger.where("playlist_id = #{params[:playlist_id]} AND song_id = #{params[:song_id]}")[0].id;
---
SELECT "ledgers".* FROM "ledgers"
SELECT "ledgers".* FROM "ledgers" WHERE (playlist_id = 1 AND song_id = 1)