app/controllers/playlists_controller.rb

SELECT "ledgers".* FROM "ledgers" WHERE "ledgers"."song_id" = $1  [["song_id", 1]]
---
  def show
    # playlist = Playlist.find(params[:id])

    # render json: { status: 200, playlist: @playlist.to_json(include: :songs) }
    # puts "hello"

    # render json: @playlist

    puts "params=#{params[:id]}"
    ledger = Ledger.where("playlist_id = #{params[:id]} AND song_id = 1");

INSERT INTO "playlists" ("title", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Hey you"], ["created_at", "2019-05-30 22:55:11.395065"], ["updated_at", "2019-05-30 22:55:11.395065"], ["user_id", 1]]
---
  def create
    @playlist = Playlist.new(playlist_params)

    if @playlist.save

UPDATE "playlists" SET "user_id" = $1, "updated_at" = $2 WHERE "playlists"."id" = $3  [["user_id", 1], ["updated_at", "2019-05-30 18:55:38.408801"], ["id", 1]]
---
  def update
    if @playlist.update(playlist_params)

DELETE FROM "playlists" WHERE "playlists"."id" = $1  [["id", 6]]
---
  def destroy
    @destroyed = @playlist.destroy

SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_playlist
      @playlist = Playlist.find(params[:id])